from math import ceil
n=int(input())
ans=''
m=0
while 1:
    if n==1:
        ans+='1'
        break
    if n==0:
        break
    if n>0:
        # nが正の数
        m=n%2
        n=-(n//2)
    else:
        # nが負の数
        m=n%2
        n=ceil(n/(-2))
    ans+=str(m)
if not ans:
    print(0)
else:
    print(''.join(reversed(ans)))

"""-2の場合 => 値の正負でちょっと違う処理(あまりが1or0になるように調整)
-9 -[-2]->1011
-9 | 1
+5 | 1
-2 | 0
+1

-2 * +5 = -10 +1
-2 * -2 = + 4 +1
-2 * +1 = - 2 +0
"""


"""10進数から2進数への変換: 2で割っていく(右側はあまり), 1になったら終わり, 逆順に並べる
128-[10->2]->10000000
128 | 0
 64 | 0
 32 | 0
 16 | 0
  8 | 0
  4 | 0
  2 | 0
  1
10000000
"""
